Revit 2027 API
ExtendedPropertiesLinkValues.AddValue Method
Overload List
Name | Description
AddValue(ForgeTypeId, Double) |  Add a double value for a given schema id.
AddValue(ForgeTypeId, Int32) |  Add an integer value for a given schema id.
AddValue(ForgeTypeId, String) |  Add a string value for a given schema id.
Top
See Also
Reference
ExtendedPropertiesLinkValues Class
Autodesk.Revit.DB.ExternalData Namespace